src/main/resources/library.wsdl

<?xml version="1.0" encoding="UTF-8" standalone="no"?><wsdl:definitions xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/" xmlns:sch0="http://ab.io/library" xmlns:sch1="http://ab.io/library" xmlns:sch2="http://ab.io/library" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:tns="http://ab.io/library" targetNamespace="http://ab.io/library">
  <wsdl:types>
    <xs:schema xmlns:xs="http://www.w3.org/2001/XMLSchema" attributeFormDefault="unqualified" elementFormDefault="qualified" targetNamespace="http://ab.io/library"><xs:complexType name="account"><xs:annotation><xs:documentation>The persistent class for the account database table.</xs:documentation></xs:annotation><xs:sequence><xs:element minOccurs="0" name="email" type="xs:string"/><xs:element minOccurs="0" name="firstName" type="xs:string"/><xs:element minOccurs="0" name="id" type="xs:int"/><xs:element minOccurs="0" name="lastName" type="xs:string"/><xs:element minOccurs="0" name="phoneNumber" type="xs:string"/><xs:element maxOccurs="unbounded" minOccurs="0" name="rentals" nillable="true" type="tns:rental"/></xs:sequence></xs:complexType><xs:complexType name="rental"><xs:annotation><xs:documentation>The persistent class for the rental database table.</xs:documentation></xs:annotation><xs:sequence><xs:element minOccurs="0" name="account" type="tns:account"/><xs:element minOccurs="0" name="book" type="tns:book"/><xs:element minOccurs="0" name="deadLine" type="xs:dateTime"/><xs:element minOccurs="0" name="id" type="tns:rentalPK"/><xs:element minOccurs="0" name="isExtended" type="xs:boolean"/></xs:sequence></xs:complexType><xs:complexType name="book"><xs:annotation><xs:documentation>The persistent class for the book database table.</xs:documentation></xs:annotation><xs:sequence><xs:element minOccurs="0" name="author" type="tns:author"/><xs:element minOccurs="0" name="copy" type="xs:int"/><xs:element minOccurs="0" name="id" type="xs:int"/><xs:element minOccurs="0" name="name" type="xs:string"/><xs:element minOccurs="0" name="publisher" type="tns:publisher"/><xs:element maxOccurs="unbounded" minOccurs="0" name="rentals" nillable="true" type="tns:rental"/><xs:element maxOccurs="unbounded" minOccurs="0" name="tags" nillable="true" type="tns:tag"/></xs:sequence></xs:complexType><xs:complexType name="author"><xs:annotation><xs:documentation>The persistent class for the author database table.</xs:documentation></xs:annotation><xs:sequence><xs:element maxOccurs="unbounded" minOccurs="0" name="books" nillable="true" type="tns:book"/><xs:element minOccurs="0" name="firstName" type="xs:string"/><xs:element minOccurs="0" name="id" type="xs:int"/><xs:element minOccurs="0" name="lastName" type="xs:string"/></xs:sequence></xs:complexType><xs:complexType name="publisher"><xs:annotation><xs:documentation>The persistent class for the publisher database table.</xs:documentation></xs:annotation><xs:sequence><xs:element maxOccurs="unbounded" minOccurs="0" name="books" nillable="true" type="tns:book"/><xs:element minOccurs="0" name="id" type="xs:int"/><xs:element minOccurs="0" name="name" type="xs:string"/></xs:sequence></xs:complexType><xs:complexType name="tag"><xs:annotation><xs:documentation>The persistent class for the tag database table.</xs:documentation></xs:annotation><xs:sequence><xs:element maxOccurs="unbounded" minOccurs="0" name="books" nillable="true" type="tns:book"/><xs:element minOccurs="0" name="id" type="xs:int"/><xs:element minOccurs="0" name="value" type="xs:string"/></xs:sequence></xs:complexType><xs:complexType name="rentalPK"><xs:annotation><xs:documentation>The primary key class for the rental database table.</xs:documentation></xs:annotation><xs:sequence><xs:element minOccurs="0" name="accountId" type="xs:int"/><xs:element minOccurs="0" name="bookId" type="xs:int"/></xs:sequence></xs:complexType></xs:schema>
    <xs:schema xmlns:xs="http://www.w3.org/2001/XMLSchema" attributeFormDefault="unqualified" elementFormDefault="qualified" targetNamespace="http://ab.io/library"><xs:element name="getAllAuthorsRequest"/><xs:element name="getAllBooksRequest"/></xs:schema>
    <xs:schema xmlns:xs="http://www.w3.org/2001/XMLSchema" attributeFormDefault="unqualified" elementFormDefault="qualified" targetNamespace="http://ab.io/library"><xs:include schemaLocation="model.xsd"/><xs:element name="getAllAuthorsResponse"><xs:complexType><xs:sequence><xs:element maxOccurs="unbounded" name="authors" type="tns:author"/></xs:sequence></xs:complexType></xs:element><xs:element name="getAllBooksResponse"><xs:complexType><xs:sequence><xs:element maxOccurs="unbounded" name="books" type="tns:book"/></xs:sequence></xs:complexType></xs:element></xs:schema>
  </wsdl:types>
  <wsdl:message name="getAllBooksResponse">
    <wsdl:part element="tns:getAllBooksResponse" name="getAllBooksResponse">
    </wsdl:part>
  </wsdl:message>
  <wsdl:message name="getAllAuthorsResponse">
    <wsdl:part element="tns:getAllAuthorsResponse" name="getAllAuthorsResponse">
    </wsdl:part>
  </wsdl:message>
  <wsdl:message name="getAllBooksRequest">
    <wsdl:part element="tns:getAllBooksRequest" name="getAllBooksRequest">
    </wsdl:part>
  </wsdl:message>
  <wsdl:message name="getAllAuthorsRequest">
    <wsdl:part element="tns:getAllAuthorsRequest" name="getAllAuthorsRequest">
    </wsdl:part>
  </wsdl:message>
  <wsdl:portType name="LibraryPort">
    <wsdl:operation name="getAllBooks">
      <wsdl:input message="tns:getAllBooksRequest" name="getAllBooksRequest">
    </wsdl:input>
      <wsdl:output message="tns:getAllBooksResponse" name="getAllBooksResponse">
    </wsdl:output>
    </wsdl:operation>
    <wsdl:operation name="getAllAuthors">
      <wsdl:input message="tns:getAllAuthorsRequest" name="getAllAuthorsRequest">
    </wsdl:input>
      <wsdl:output message="tns:getAllAuthorsResponse" name="getAllAuthorsResponse">
    </wsdl:output>
    </wsdl:operation>
  </wsdl:portType>
  <wsdl:binding name="LibraryPortSoap11" type="tns:LibraryPort">
    <soap:binding style="document" transport="http://schemas.xmlsoap.org/soap/http"/>
    <wsdl:operation name="getAllBooks">
      <soap:operation soapAction=""/>
      <wsdl:input name="getAllBooksRequest">
        <soap:body use="literal"/>
      </wsdl:input>
      <wsdl:output name="getAllBooksResponse">
        <soap:body use="literal"/>
      </wsdl:output>
    </wsdl:operation>
    <wsdl:operation name="getAllAuthors">
      <soap:operation soapAction=""/>
      <wsdl:input name="getAllAuthorsRequest">
        <soap:body use="literal"/>
      </wsdl:input>
      <wsdl:output name="getAllAuthorsResponse">
        <soap:body use="literal"/>
      </wsdl:output>
    </wsdl:operation>
  </wsdl:binding>
  <wsdl:service name="LibraryPortService">
    <wsdl:port binding="tns:LibraryPortSoap11" name="LibraryPortSoap11">
      <soap:address location="http://localhost:8080/soap"/>
    </wsdl:port>
  </wsdl:service>
</wsdl:definitions>