request.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
				  xmlns:gs="http://ab.io/library">
   <soapenv:Header/>
   <soapenv:Body>
      <gs:getAllAuthorsRequest/>
   </soapenv:Body>
</soapenv:Envelope>
